# I. Import and clean data

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from statsmodels.tsa.vector_ar.vecm import coint_johansen
import optuna

In [2]:
TTT = pd.read_excel('TTT.xlsx')

In [6]:
TTT.isna().sum()

YEAR         0
FLT_MONTH    0
FLT_DATE     0
NET3         0
AREA         4
Country      4
SECTOR_2W    0
Pax          0
dtype: int64

In [9]:
TTT.dropna(inplace = True)

In [10]:
TTT.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 349504 entries, 0 to 349507
Data columns (total 8 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   YEAR       349504 non-null  int64
 1   FLT_MONTH  349504 non-null  int64
 2   FLT_DATE   349504 non-null  datetime64[ns]
 3   NET3       349504 non-null  object
 4   AREA       349504 non-null  object
 5   Country    349504 non-null  object
 6   SECTOR_2W  349504 non-null  object
 7   Pax        349504 non-null  int64
dtypes: datetime64[ns](1), int64(3), object(4)
memory usage: 24.0+ MB

In [11]:
TTT['NET3'].unique()

array(['DOM', 'INT'], dtype=object)

In [16]:
TTT['AREA'].unique()

array(['DIA PHUONG', 'DU LICH', 'HANDAD', 'HANSGN', 'SGNDAD', 'TRUC LE',
       '(blank)', 'CLMV', 'EUR', 'MID', 'NEA', 'NOA', 'SEA', 'SWP', 'ZZ',
       'AFR', 'CSA', 'SAS', 'ĐỊA PHƯƠNG', 'SAR', 'CCA'], dtype=object)

In [18]:
TTT.drop(TTT.loc[TTT['AREA']=='(blank)'].index, inplace=True)

In [20]:
TTT['Country'].unique()

array(['VN', 'KH', 'LA', 'MM', 'DE', 'FR', 'RU', 'AE', 'QA', 'CN', 'HK',
       'JP', 'KR', 'MO', 'TW', 'US', 'BN', 'ID', 'MY', 'PH', 'SG', 'TH',
       'AU', 'GB', 'PL', 'ZZ', 'KE', 'FI', 'NZ', 'TR', 'UZ', 'IR', 'IN',
       'IQ', 'BD', 'SZ', 'IT', 'SE', 'DK', 'NO', 'CZ', 'ES', 'BE', 'PT',
       'AO', 'CO', 'BY', 'RO', 'GQ', 'CY', 'SA', 'UA', 'JO', 'NL', 'LK',
       'IL', 'BH', 'OM', 'TK', 'AT', 'CA', 'HU', 'KZ', 'BT'], dtype=object)

In [22]:
TTT[TTT['SECTOR_2W']=='(blank)']

Empty DataFrame
Columns: [YEAR, FLT_MONTH, FLT_DATE, NET3, AREA, Country, SECTOR_2W, Pax]
Index: []

In [23]:
dom = TTT[TTT['NET3']=='DOM'].copy()

In [24]:
dom

        YEAR  FLT_MONTH   FLT_DATE NET3        AREA Country SECTOR_2W   Pax
0       2015          1 2015-01-01  DOM  DIA PHUONG      VN    DADBMV   134
1       2015          1 2015-01-01  DOM  DIA PHUONG      VN    DADHPH   203
2       2015          1 2015-01-01  DOM  DIA PHUONG      VN    DADPXU   123
3       2015          1 2015-01-01  DOM  DIA PHUONG      VN    DADVCA   334
4       2015          1 2015-01-01  DOM  DIA PHUONG      VN    DADVII   118
...      ...        ...        ...  ...         ...     ...       ...   ...
349469  2023          2 2023-02-21  DOM      SGNDAD      VN    SGNDAD  4499
349470  2023          2 2023-02-21  DOM     TRUC LE      VN    HANVCA   938
349471  2023          2 2023-02-21  DOM     TRUC LE      VN    SGNHPH  1480
349472  2023          2 2023-02-21  DOM     TRUC LE      VN    SGNTHD   553
349473  2023          2 2023-02-21  DOM     TRUC LE      VN    SGNVII  1360

[133326 rows x 8 columns]

In [25]:
dom['AREA'].unique()

array(['DIA PHUONG', 'DU LICH', 'HANDAD', 'HANSGN', 'SGNDAD', 'TRUC LE',
       'ĐỊA PHƯƠNG'], dtype=object)